backend/app/controllers/api/bookings_controller.rb

    def index
      bookings = current_user.bookings.includes(:vehicle, :payment).order(created_at: :desc)
      render json: bookings.map { |b| booking_json(b) }
---
SELECT "payments".* FROM "payments" WHERE "payments"."booking_id" IN ($1, $2)  [["booking_id", 6], ["booking_id", 3]]
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" IN ($1, $2)  [["id", 49], ["id", 50]]

    def owner
      vehicle_ids = current_user.vehicles.pluck(:id)
      bookings    = Booking.where(vehicle_id: vehicle_ids)
                           .includes(:vehicle, :renter)
                           .order(created_at: :desc)

      render json: bookings.map { |b| booking_json(b, owner_view: true) }
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."vehicle_id" IN ($1, $2) ORDER BY "bookings"."created_at" DESC  [["vehicle_id", 10], ["vehicle_id", 11]]
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1  [["id", 60]]

    def create
      vehicle = Vehicle.find(params.dig(:booking, :vehicle_id) || params[:vehicle_id])
      booking = vehicle.bookings.build(booking_params)
      booking.renter = current_user

      if booking.save
---
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "bookings" ("vehicle_id", "renter_id", "start_date", "end_date", "total_price", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def destroy
      booking = current_user.bookings.find(params[:id])
      booking.update!(status: "cancelled")
---
UPDATE "bookings" SET "status" = $1, "updated_at" = $2 WHERE "bookings"."id" = $3  [["status", "cancelled"], ["updated_at", "2026-03-08 03:07:17.503498"], ["id", 12]]

    def cancel_by_owner
      vehicle_ids = current_user.vehicles.pluck(:id)
      booking = Booking.where(vehicle_id: vehicle_ids).find(params[:id])
      booking.update!(status: "cancelled")
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."vehicle_id" = $1 AND "bookings"."id" = $2 LIMIT $3  [["vehicle_id", 19], ["id", 13], ["LIMIT", 1]]
UPDATE "bookings" SET "status" = $1, "updated_at" = $2 WHERE "bookings"."id" = $3  [["status", "cancelled"], ["updated_at", "2026-03-08 03:07:17.564222"], ["id", 13]]