backend/app/controllers/api/payments_controller.rb

SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT $2  [["id", 49], ["LIMIT", 1]]
INSERT INTO "bookings" ("vehicle_id", "renter_id", "start_date", "end_date", "total_price", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
INSERT INTO "payments" ("booking_id", "paypal_order_id", "amount", "currency", "payer_name", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def capture
      if current_user.role == "owner"
        return render json: { error: "Owners cannot book vehicles" }, status: :forbidden
      end

      vehicle = Vehicle.find(params[:vehicle_id])

      # Build booking
      booking = vehicle.bookings.build(
        renter:      current_user,
        start_date:  params[:start_date],
        end_date:    params[:end_date],
        status:      "confirmed"
      )

      # Build payment record
      payment = booking.build_payment(
        paypal_order_id: params[:paypal_order_id],
        amount:          params[:total_price],
        currency:        "GBP",
        payer_name:      params[:payer_name],
        status:          "completed"
      )

      if booking.save