backend/app/controllers/api/profiles_controller.rb

UPDATE "users" SET "name" = $1, "phone" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Nithin Krishna"], ["phone", "07306904340"], ["updated_at", "2026-03-08 06:43:12.206315"], ["id", 34]]
---
    def update
      if current_user.update(profile_params)

UPDATE "users" SET "encrypted_password" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["encrypted_password", "$2a$12$hCjeQ/9.iCxzqJk36.RUG.M7efsjcqfw7mSpjZ2OhhGdOgbCHS1kC"], ["updated_at", "2026-03-08 05:46:29.238002"], ["id", 34]]
---
    def password
      unless current_user.valid_password?(params[:current_password])
        return render json: { error: "Current password is incorrect" }, status: :unprocessable_entity
      end

      if params[:new_password].length < 6
        return render json: { error: "New password must be at least 6 characters" }, status: :unprocessable_entity
      end

      if params[:new_password] != params[:confirm_password]
        return render json: { error: "Passwords do not match" }, status: :unprocessable_entity
      end

      current_user.update!(password: params[:new_password])