backend/app/controllers/api/vehicles_controller.rb

    def index
      vehicles = if params[:all].present? && current_user&.admin?
                   Vehicle.all
---
SELECT "vehicles".* FROM "vehicles"

    def create
      unless current_user.owner?
        return render json: { error: "Only owners can list vehicles" }, status: :forbidden
      end

      vehicle = current_user.vehicles.build(vehicle_params)
      vehicle.status = "pending"

      if vehicle.save
---
INSERT INTO "vehicles" ("name", "vehicle_type", "model", "location", "rate", "description", "status", "owner_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

    def update
      if @vehicle.update(vehicle_params)
---
UPDATE "vehicles" SET "location" = $1, "updated_at" = $2 WHERE "vehicles"."id" = $3  [["location", "London"], ["updated_at", "2026-03-08 07:26:02.502447"], ["id", 61]]

    def destroy
      @vehicle.destroy
---
DELETE FROM "vehicles" WHERE "vehicles"."id" = $1  [["id", 60]]

    def set_vehicle
      @vehicle = Vehicle.find(params[:id])
---
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT $2  [["id", 50], ["LIMIT", 1]]

    def vehicle_json(vehicle, include_bookings: false)
      data = {
        id:           vehicle.id,
        name:         vehicle.name,
        vehicle_type: vehicle.vehicle_type,
        model:        vehicle.model,
        location:     vehicle.location,
        rate:         vehicle.rate,
        description:  vehicle.description,
        status:       vehicle.status,
        owner_id:     vehicle.owner_id,
        image_url:    vehicle_image(vehicle),
        created_at:   vehicle.created_at
      }

      if include_bookings
        data[:bookings] = vehicle.bookings.confirmed.map do |b|
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."vehicle_id" = $1 AND "bookings"."status" = $2  [["vehicle_id", 50], ["status", "confirmed"]]