backend/app/controllers/api/admin/dashboard_controller.rb

SELECT SUM("payments"."amount") FROM "payments" WHERE "payments"."status" = $1  [["status", "completed"]]
SELECT COUNT(*) FROM "bookings" WHERE "bookings"."status" = $1  [["status", "confirmed"]]
---
      def stats
        total_revenue = Payment.where(status: "completed").sum(:amount)

        render json: {
          total_users:    User.count,
          total_vehicles: Vehicle.count,
          total_bookings: Booking.where(status: "confirmed").count,
          total_revenue:  total_revenue