backend/app/controllers/api/admin/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC
---
      def index
        users = User.all.order(created_at: :desc)
        render json: users.map { |u|

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 23]]
---
      def destroy
        user = User.find(params[:id])

        if user == current_user
          return render json: { error: "Cannot delete your own account" }, status: :unprocessable_entity
        end

        user.destroy