backend/app/controllers/api/auth/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "customer@vehiclerental.com"], ["LIMIT", 1]]
---
      def create
        user = User.find_by(email: params.dig(:user, :email).to_s.downcase.strip)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
UPDATE "users" SET "jti" = $1 WHERE "users"."id" = $2  [["jti", "920aaccc-b3b7-4527-8172-19c1c1e986d7"], ["id", 20]]
---
      def destroy
        token = request.headers["Authorization"]&.split(" ")&.last

        if token.blank?
          return render json: { message: "No active session" }, status: :unauthorized
        end

        begin
          payload = Warden::JWTAuth::TokenDecoder.new.call(token)
          user    = User.find_by(id: payload["sub"])
        rescue StandardError
          user = nil
        end

        if user
          user.update_column(:jti, SecureRandom.uuid)